{
    "th" : {
        "font": "fc_quantum",
        "bio-header": "\"ภูมิ\" คือใคร?",
        "bio-body": 
            "ผมเป็นคนๆ หนึ่ง ที่ทำงานกับเกมและเล่นเกม เรียนจบมาจาก University of California, Santa Cruz<br><br>ถ้าหากมีใครถามว่า \"มีส่วนไหนของนิสัยผมบ้างไหมที่ไม่เปลี่ยนไป ระหว่างเวลาทำงานกับเวลาเล่นเกม?\" ผมคงต้องตอบว่า \"ความอยากรู้ อยากลองที่ไม่มีที่สิ้นสุด เพื่อที่จะเก่งพอที่จะช่วยทีมได้ ไม่ใช่เพียงแค่เอาตัวรอด\"<br><br>ผมเห็นว่าคนที่เรียกว่าเป็นคนที่เล่นเกม <i>Monster Hunter</i> เก่งได้ จะต้องเป็นคนที่ดูแลเพื่อนร่วมทีมไปด้วยตีมอนเสตอร์ไปด้วยได้ฉันใด ฉันนั้นแล้วคนที่จะถือได้ว่าเป็นโปรแกรมเมอร์ที่ดีจะต้องทำได้มากกว่าแค่เขียนโค้ดที่แค่พอใช้งานได้ แต่ต้องทำให้ productivity ของทีมเพิ่มขึ้นได้อีกด้วย<br><br>เพราะความคิดเช่นนี้ผมจึงได้เป็นผมอย่างที่เป็นตอนนี้ ไม่ได้ฝึกเขียนโค้ดแต่เพียงอย่างเดียว แต่ทำความรู้จักกับหน้าที่หลากหลาย เพื่อให้ได้เข้าใจว่า ต้องทำเช่นไรจึงจะทำประโยชน์ให้กับทีมได้ถึงที่สุด",
        "raptoroids-body":
            "<i>Raptoroids</i> เป็นเกมโปรเจ็กจบของผมในขณะที่เรียนอยู่ที่ UC Santa Cruz ผมได้ทำโปรเจ็กนี้ในฐานะ producer แต่ก็มีส่วนในการเขียนโค้ด งานกราฟิก และเสียงด้วย ทางทีมผมได้ใช้ Unity ในการทำโปรเจ็กนี้ ส่วนงานกราฟิกใช้ Aseprite เขียน ส่วน sound effect นั้นหามาจากอินเทอร์เน็ต แต่ background music นั้นผมเป็นคนเขียนเอง<br><br>เกมนี้เป็นเกมแนว shmup โดยมีความเป็น roguelite แฝงอยู่เล็กน้อย ผู้เล่นสามารถปลดล็อค Raptoroid และอาวุธต่างๆ โดยการเก็บเพชรผ่านการทำภารกิจ โดยผู้เล่นสามารถเลือกเส้นทางในการเข้าหาบอสของแต่ละภารกิจได้ บอสในตอนนี้มีให้เลือกอยู่ 4 ตัว<br><br>ดาวน์โหลดได้ที่ <a href=\"https://apps.apple.com/us/app/raptoroids/id6502815414\" target=\"_blank\">iOS App Store</a>",
        "tic-body":
            "<i>Thrown into Chaos</i> เป็นอีกหนึ่งโปรเจ็กที่ผมได้ทำตอนเรียนที่ UC Santa Cruz โดยในโปรเจ็กนี้นั้นผมเป็นโปรแกรมเมอร์อยู่คนเดียว โปรเจ็กนี้ใช้ Unreal Engine 4 ทำ ผมเลยได้เขียนโค้ดเป็นภาษา C++ ที่ใช้ได้กับ Blueprint ของ Unreal Engine เพื่อให้เพื่อนๆ ในทีมเอาไปต่อยอดได้โดยไม่ต้องเรียนรู้การเขียนโค้ด<br><br>เกมนี้เป็นเกมแนว action เป็นเกมเกี่ยวกับการเล่น dodgeball เพื่อที่จะปราบมนุษย์ต่างดาวที่จ้องจะยึดครองโลก<br><br>ดาวน์โหลดได้ที่ <a href=\"https://freddeep.itch.io/artg120-final\" target=\"_blank\">itch.io</a> (Note: เล่นได้เฉพาะเครื่อง Windows เท่านั้น)",
        "asgn-body":
            "ไฮไลท์ผลงานโปรแกรมมิ่งในขณะเรียนที่ UC Santa Cruz",
        "cse111-highlight":
            "<b>CSE 111 - <i>Advanced Programming</i>:</b> การบ้านชิ้นสุดท้ายของคลาสนี้ต้องการให้มีการใช้ multithread และ distributed programming เพื่อแกะรหัส 4 หลัก 7 ตัว ด้วยวิธีการ brute force<br>ผมได้แบ่ง search space ให้คอมฯ ที่อาจารย์ให้พวกเรานักเรียนได้ใช้กันทั้ง 4 เครื่อง แล้วให้เครื่องที่หารหัสเจอให้แจ้งให้คอมฯ เครื่องอื่นๆ ว่าเจอรหัสแล้ว และให้หารหัสถัดไป<br><br>โปรแกรมนี้เขียนไว้เพื่อใช้งานกับ server ที่อาจารย์ให้พวกเราใช้เท่านั้น<br><a href=\"./etc/CSE111Assignment8.zip\" download>ดาวน์โหลด source code ได้ที่นี่</a>",
        "cse101-highlight":
            "<b>CSE 101 - <i>Data Structures and Algorithms</i>:</b> การบ้านชิ้นที่ 6 ของคลาสนี้ เป็นการประยุกต์ linked list ไปเป็น data type ที่เรียกว่า BigInt ซึ่งสามารถแทนตัวเลขจำนวนเต็มได้ครบถ้วนมากกว่า data type อย่าง <code>long long</code><br>สามารถใช้ BigInt ในการบวก ลบ หรือคูณตัวเลขได้ แต่ไม่สามารถทำการหารได้<br><a href=\"./etc/CSE101Assignment6.zip\" download>ดาวน์โหลด source code ได้ที่นี่</a>.<br>Note: ต้อง compile โค้ดจึงจะรันโปรแกรมนี้ได้ โดยใช้ compiler g++"
    },

    "en" : {
        "font": "orbitron",
        "bio-header": "Who is 'Poom?'",
        "bio-body": 
            "Just a dude who works on and plays games who happened to have graduated from University of California, Santa Cruz.<br><br>If there's one thing in common between my work-mode self and my play-mode self, it's the drive to maximize contributions to the team, expressed as a never-ending quest to learn, adapt, and cooperate.<br><br>Much like how a good <i>Monster Hunter</i> team player keeps watch over their teammates and the target simultaneously, I believe that being a good game programmer's responsibility isn't only to make sure that their code works -- but also to make sure that they can boost the team's productivity.<br><br>From this belief stems what I believe to be what makes me 'me' -- not only do I put care into honing my expertise of programming, but I spend time to familiarize myself with other disciplines as well, so that I can assist my teammates, and write code in a way doesn't only just work, but amplifies the team's productivity as well.",
        "raptoroids-body":
            "<i>Raptoroids</i> is my capstone project from my time at UC Santa Cruz. Though I am the producer nominally for this project, I was majorly involved in programming, sprites, and sounds. For this project, my team and I used the Unity engine. Sprites were drawn using Aseprite. Sound effects were sourced from the Internet, while background music was composed by me.<br><br>The game blends the shmup genre with elements of roguelites. Complete missions to gain resources to unlock Raptoroids and weapons. Choose your path towards the boss of each mission. Fight 4 unique, ferocious bosses to stop them from taking over the planet.<br><br>Available on the <a href=\"https://apps.apple.com/us/app/raptoroids/id6502815414\" target=\"_blank\">iOS App Store</a>",
        "tic-body":
            "<i>Thrown into Chaos</i> is another one of my projects from my time at UC Santa Cruz. In this project, I served as the only programmer on the team. One of my teammates had experience with using Unreal Engine 4, which is why we used that for this project. I wrote C++ code that extends the engine's Blueprints to open up more possibilities for my teammates.<br><br>The game is a fast-paced action game that follows the player as they become the world's dodgeball champion in order to repel an alien seeking to conquer the Earth.<br><br>Available for download from <a href=\"https://freddeep.itch.io/artg120-final\" target=\"_blank\">itch.io</a> (Note: available only on Windows)",
        "asgn-body":
            "Here are some of my proudest works as a student of UC Santa Cruz.",
        "cse111-highlight":
            "<b>CSE 111 - <i>Advanced Programming</i>:</b> The final assignment for this class involves multithreading and distributed programming. The goal was to crack seven 4-digit passwords using brute force. The approach I used was to divide the search space as evenly as possible between each of the 4 machines that were available to students, and having the machine that finds the password notify all other machines that the matching password has been found and to move on to the next password.<br><br>Please note that this program is written specifically to run on the professor's teaching servers.<br><a href=\"./etc/CSE111Assignment8.zip\" download>Download source code here</a>.",
        "cse101-highlight":
            "<b>CSE 101 - <i>Data Structures and Algorithms</i>:</b> The sixth assignment of this class involves the use of linked list to implement a BigInt data type. This data type is capable of representing a much wider range of integers than the <code>long long</code> data type, though it only supports addition, subtraction, and multiplication operations.<br><a href=\"./etc/CSE101Assignment6.zip\" download>Download source code here</a>.<br>Note: code needs to be compiled into an executable to run. g++ compiler was used when working on this assignment."
    }
}